projects/dfg_prelim/template/CFD/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application lamfoamIBSolver;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 0.1;
deltaT 0.0001;
writeControl timeStep;
writeInterval 20;
writeFormat ascii;
writePrecision 14;
writeCompression off;
timeFormat general;
timePrecision 8;
runTimeModifiable false;
