projects/dfg_prelim/template/CFD/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

convertToMeters 0.008;
vertices ((0 0 0) (1 0 0) (1 1 0) (0 1 0) (0 0 1) (1 0 1) (1 1 1) (0 1 1));
blocks (hex (0 1 2 3 4 5 6 7) (40 40 40) simpleGrading (1 1 1));
edges ();
boundary (xmin { type wall; neighbourPatch xmax; faces ((0 4 7 3)); }
xmax { type wall; neighbourPatch xmin; faces ((1 2 6 5)); }
ymin { type wall; neighbourPatch ymax; faces ((0 1 5 4)); }
ymax { type wall; neighbourPatch ymin; faces ((3 7 6 2)); }
zmin { type wall; neighbourPatch zmax; faces ((0 3 2 1)); }
zmax { type wall; neighbourPatch zmin; faces ((4 5 6 7)); });
mergePatchPairs ();
