projects/dfg_prelim/template/CFD/constant/momentumTransport
FoamFile { version 2.0; format ascii; class dictionary; object momentumTransport; }

// Quiescent diffusion experiment: no turbulence model.
simulationType laminar;
