projects/dfg_prelim/template/CFD/constant/physicalProperties
FoamFile { version 2.0; format ascii; class dictionary; object physicalProperties; }
viscosityModel constant;
nu [0 2 -1 0 0 0 0] 1e-6;
rho [1 -3 0 0 0 0 0] 1000;
