projects/dfg_prelim/template/CFD/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
xmin { type fixedValue; value uniform (0 0 0); }
xmax { type fixedValue; value uniform (0 0 0); }
ymin { type fixedValue; value uniform (0 0 0); }
ymax { type fixedValue; value uniform (0 0 0); }
zmin { type fixedValue; value uniform (0 0 0); }
zmax { type fixedValue; value uniform (0 0 0); }
}
