projects/dfg_prelim/template/CFD/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
xmin { type zeroGradient; }
xmax { type zeroGradient; }
ymin { type zeroGradient; }
ymax { type zeroGradient; }
zmin { type zeroGradient; }
zmax { type zeroGradient; }
}
