projects/dfg_prelim/template/CFD/0/alpha
FoamFile { version 2.0; format ascii; class volScalarField; object alpha; }
dimensions [0 0 0 0 0 0 0];
internalField uniform 0.8;
boundaryField
{
xmin { type zeroGradient; }
xmax { type zeroGradient; }
ymin { type zeroGradient; }
ymax { type zeroGradient; }
zmin { type zeroGradient; }
zmax { type zeroGradient; }
}
