projects/dfg_prelim/template/CFD/0/oxygen
FoamFile { version 2.0; format ascii; class volScalarField; object oxygen; }
dimensions [0 -3 0 0 1 0 0];
internalField uniform 1;
boundaryField
{
xmin { type zeroGradient; }
xmax { type zeroGradient; }
ymin { type zeroGradient; }
ymax { type zeroGradient; }
zmin { type zeroGradient; }
zmax { type zeroGradient; }
}
