projects/dfg_prelim/template/CFD/0/particleMomentumSource
FoamFile { version 2.0; format ascii; class volVectorField; object particleMomentumSource; }
dimensions [0 1 -2 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
xmin { type zeroGradient; }
xmax { type zeroGradient; }
ymin { type zeroGradient; }
ymax { type zeroGradient; }
zmin { type zeroGradient; }
zmax { type zeroGradient; }
}
