projects/dfg_prelim/template/CFD/0/voidFraction
FoamFile { version 2.0; format ascii; class volScalarField; object voidFraction; }
dimensions [0 0 0 0 0 0 0];
internalField uniform 1;
boundaryField
{
xmin { type zeroGradient; }
xmax { type zeroGradient; }
ymin { type zeroGradient; }
ymax { type zeroGradient; }
zmin { type zeroGradient; }
zmax { type zeroGradient; }
}
