projects/dfg_prelim/template/CFD/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    oxygen { solver PBiCGStab; preconditioner DILU; tolerance 1e-12; relTol 0; }
    phiIB { solver PCG; preconditioner DIC; tolerance 1e-12; relTol 0; }
    p { solver PCG; preconditioner DIC; tolerance 1e-12; relTol 0; }
    pFinal { $p; }
    "(U|UFinal|flm|flmFinal|fmm|fmmFinal)"
    { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-12; relTol 0; }
}
PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor true;
    pRefCell 0;
    pRefValue 0;
}

PISO { nCorrectors 2; nNonOrthogonalCorrectors 0; pRefCell 0; pRefValue 0; }
