projects/dfg_prelim/template/CFD/system/decomposeParDict
FoamFile { version 2.0; format ascii; class dictionary; object decomposeParDict; }
numberOfSubdomains 8; method simple; simpleCoeffs { n (2 2 2); delta 0.001; }
